#!/usr/bin/env bash

# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'boz/repo'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'


# Install Binaries
brew 'git'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'wget'

# Development
brew 'php'
brew 'mysql'
brew 'kubectl'
brew 'ansible'
brew 'boz/repo/kail'
brew 'redis'
brew 'dnsmasq'
brew 'php@7.1'
brew 'fzf'
brew 'diff-so-fancy'
brew 'bat'


# Apps
cask 'aerial'
cask 'docker'
cask 'dropbox'
cask 'google-chrome'
cask 'iterm2'
cask 'imageoptim'
cask 'jetbrains-toolbox'
cask 'noizio'
cask 'onepassword'
cask 'pocket'
cask 'reeder'
cask 'sequel-pro'
cask 'slack'
cask 'spotify'
cask 'textual'
cask 'vagrant'
cask 'virtualbox'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-fira-code'
cask 'font-fira-mono-for-powerline'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'font-meslo-lg'
cask 'font-meslo-for-powerline'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas '1Password', id: 443987910
mas 'Giphy Capture', id: 668208984
mas 'Noizio', id: 928871589
mas 'The Unarchiver', id: 425424353
mas 'Tweetbot', id: 1384080005
mas 'WhatsApp', id: 1147396723 
